app/controllers/answers_controller.rb

  def index
    @city = City.find(params[:city_id])
    @question = Question.find(params[:question_id])
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", "1"]]

  def show
    @city = City.find(params[:city_id])
    @question = Question.find(params[:question_id])
    @answer = Answer.find(params[:id])
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "271"]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", "307"]]
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", "2"]]

  def new
    authenticate_user!
    @city = City.find(params[:city_id])
    @question = Question.find(params[:question_id])
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    authenticate_user!
    @user = current_user
    @city = City.find(params[:city_id])
    @question = Question.find(params[:question_id])
    @answer = @question.answers.build(params[:answer])
    if @answer.save
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "answers" ("body", "created_at", "question_id", "updated_at", "user_id", "vote_count") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    authenticate_user!
    @city = City.find(params[:city_id])
    @question = Question.find(params[:question_id])
    @answer = Answer.find(params[:answer_id])
    if @answer.update_attributes(params[:answer])
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "344"]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", "380"]]
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", "89"]]
UPDATE "answers" SET "body" = 'new answer', "updated_at" = '2014-02-22 01:36:00.150606' WHERE "answers"."id" = 89

  def destroy
    authenticate_user!
    @city = City.find(params[:city_id])
    @question = Question.find(params[:question_id])
    @answer = Answer.find(params[:answer_id])
    @answer.destroy
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 1]]