app/controllers/cities_controller.rb

  def create
    @city = City.new(params[:city])
    if @city.save
---
INSERT INTO "cities" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 21 Feb 2014 02:07:40 UTC +00:00], ["description", "dsfsd"], ["name", "sdfsd"], ["updated_at", Fri, 21 Feb 2014 02:07:40 UTC +00:00]]

  def edit
    @city = City.find(params[:id])
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "4"]]

  def update
    @city = City.find(params[:id])
    if @city.update_attributes(params[:city])
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "4"]]
UPDATE "cities" SET "name" = 'alaa', "updated_at" = '2014-02-21 02:14:00.973589' WHERE "cities"."id" = 4

  def destroy
    @city = City.find(params[:id])
    @city.destroy
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "513"]]
DELETE FROM "cities" WHERE "cities"."id" = $1  [["id", 513]]