app/controllers/posts_controller.rb

SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "5"]]
---
	def new
		@post = Post.new
		@city = City.find(params[:city_id])

INSERT INTO "posts" ("body", "city_id", "created_at", "title", "updated_at", "user_id", "vote_count") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		post = Post.new(params[:post])
		if post.save