app/controllers/questions_controller.rb

	def index
		@city = City.find(params[:city_id])
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "5"]]

	def new
		authenticate_user!
		@city = City.find(params[:city_id])
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "1"]]

	def create
		authenticate_user!
		@user = current_user
		@city = City.find(params[:city_id])
		@question = @city.questions.build(params[:question])
		if @question.save
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "questions" ("body", "city_id", "created_at", "title", "updated_at", "user_id", "vote_count") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

	def show
		@city = City.find(params[:city_id])
		@question = Question.find(params[:id])
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", "5"]]

	def edit
		authenticate_user!
		@question = Question.find(params[:id])
		@city = City.find(params[:city_id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "1"]]

	def update
		authenticate_user!
		question = Question.find(params[:id])
		city = City.find(params[:city_id])
		if question.update_attributes(params[:question])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "questions" SET "body" = 'I really want to know where the girls are at.', "updated_at" = '2014-02-22 20:27:37.280536' WHERE "questions"."id" = 1

	def destroy
		authenticate_user!
		Question.find(params[:id]).destroy
---
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", "1"]]